# IsAutoGenerated Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalLink..::..IsAutoGenerated Method
AnalyticalLink Class See Also
---
Specifies whether or not an AnalyticalLink was created by an AnalyticalModel element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsAutoGenerated()
```

Visual Basic
---
```text
Public Function IsAutoGenerated As Boolean
```

Visual C++
---
```text
public:
bool IsAutoGenerated()
```

# ### Return Value
True if AnalyticalLink was created by an AnalyticalModel element, false otherwise.
# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace